{
  "GtexGeneExpression": {
    "desc": "I can query the expression of your gene across tissues from GTEx version 8 and produced a plot of z-scored values. Please ensure the gene symbol below is correct:",
    "input": "GeneInput"
  },
  "ARCHS4GeneExpression": {
    "desc": "I can query the expression of your gene across tissues from ARCHS4 and produced a plot of z-scored values. Please ensure the gene symbol below is correct:",
    "input": "GeneInput"
  },
  "ImpcPhenotypes": {
    "desc": "I can query IMPC which contains mouse phenotype information associated with gene markers. It's API allows us to identify phenotypes significantly associated with a gene. Please ensure the gene symbol below is correct: ",
    "input": "GeneInput"
  },
  "ReverseSearchL1000": {
    "desc": "I can query RNA-seq-like LINCS L1000 Signatures sourced from SigComLincs which mimick or reverse the the expression of your gene and visualized the result. Please ensure the gene symbol below is correct:",
    "input": "GeneInput"
  },
  "KidsFirstTumorExpr": {
    "desc": "I can query gene expression in tumors for your gene from the Open Pediatric Cancer Atlas API. Please ensure the gene symbol below is correct:",
    "input": "GeneInput"
  },
  "RegElementSetInfo": {
    "desc": "I can query regulatory elements from the Linked Data Hub. Please ensure the gene symbol below is correct:",
    "input": "GeneInput"
  },
  "sigComLincs": {
    "desc": "I can send your gene set(s) to SigCom LINCS which is a web-based search engine that serves over 1.5 million gene expression signatures processed, analyzed, and visualized from LINCS, GTEx, and GEO. SigCom LINCS provides rapid signature similarity search for mimickers and reversers given sets of up and down genes. Once you submit your gene set I will provide a link to the result:",
    "input": "GeneSetInput"
  },
  "GlyGenbyGlyTouCan": {
    "desc": "I can query the GlyGen database to identify a information about your glycan. Please ensure the glycan name below is correct:",
    "input": "GlycanInput"
  },
  "PhenotypeSmallMolecules": {
    "desc": "I can first query Enrichr for terms related to the phenotype. Matching terms from the MGI Mammalian Phenotype Level 4 2019, KEGG 2021 Human, and GO Biological Process 2021 libraries are assembled into three collections of gene sets (GMTs). All the identified gene sets for each GMT are combined using the union set operation. Reversers and mimickers from over 1 million signatures are identified using SigCom LINCS. Mean scores were computed across the GMTs and the drugs were filtered by FDA Approved Drugs with the help of PubChem APIs.",
    "input": "PhenotypeInput"
  }
}
